      ******************************************************************
      * Author: Yamolnut Toeysiriset
      * Date: 30 June 2025
      * Purpose: HELLO COBOL!
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 1_Hello.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "HELLO, COBOL WORLD!"
            DISPLAY "Yamolnut"
            DISPLAY "Hi Hi!"
            DISPLAY "Ohayo <3"
            STOP RUN.
       END PROGRAM 1_Hello.
